// За една статистичка анализа потребна е програма за управување со кафетерии. За таа цел
// да се направат две структури: структура за кафетерија и структура за вработен. За секоја
// кафетерија се знае името, бројот на вработени и низа од променливи од тип структура вработен
// (во низата има максимум 5 променливи). За секој вработен се знае името, работната позиција
// (келнер, шанкер или менаџер) и платата.

// Да се напише функција raspredeli која на влез добива покажувач кон кафетерија, низа од
// вработени и должина на низата. Функцијата треба да ја измине низата од вработени и да провери
// дали истите се дел од кафетеријата, ако не се треба да ги додаде на крај од низата со вработени во
// кафетеријата.

// Да се напише функција pechati која ќе прима низа од променливи од тип кафетерија,
// должина на низата и променлива плата како влезни аргументи, а ќе ги испечати имињата и
// работните позиции на сите вработени кои имаат поголема плата од влезниот аргумент во било која
// од кафетериите кои се дел од влезната низа.

// Во главната програма да се иницијализираат две низи со по 2 вработени и низа од две
// кафетерии со по еден вработен. Потоа со помош на функцијата raspredeli да се додадат вработените
// од низите со вработени во кафетериите (вработените од првата низа во првата кафетерија, а
// вработените од втората низа во втората кафетерија) (потребни се две повикувања). Со употреба на
// функција pechati, да се испечатат имињата на сите келнери кои имаат плата помала од 25 000, без
// разлика на кафетеријата во којa работат (функцијата да се повика еднаш). 

#include<stdio.h>
#include<string.h>

typedef struct s1{
    char ime[30];
    char rabPoz[30];
    int plata
}vraboten;

typedef struct s2{
    char ime[30];
    int brVraboteni;
    vraboten vraboteni[5];
}kafeterija;

void raspredeli(kafeterija *c,vraboten vraboteni[],int N){
    int i,j;
    int p=0;
    for(i=0;i<N;i++){
        for(j=0;j<c->brVraboteni;j++){
            if(strcmp(c->vraboteni[j].ime,vraboteni[i].ime)==0){
                p=1;
                break;
            }
        }
        if(!p){
            c->vraboteni[j]=vraboteni[i];
            c->brVraboteni++;
        }
    }
}

void pechati(kafeterija niza[],int N,int plata){
    int i,j;
    for(i=0;i<N;i++){
        for(j=0;j<niza[i].brVraboteni;j++){
            if(niza[i].vraboteni[j].plata<plata){
                printf("%s %s\n",niza[i].vraboteni[j].ime,niza[i].vraboteni[j].rabPoz);
            }
        }
    }
}

int main(){
    vraboten niza1[]={{"Kosta","Kelner",23000},{"Petar","Shanker",28000}};
    vraboten niza2[]={{"Velimir","Kelner",24000},{"Nikola","Menadzer",26000}};
    
    kafeterija kaf1={"Kafana1",1,{{"Goran","Menadzer",35000}}};
    kafeterija kaf2={"Kafana2",1,{{"Jugoslav","Menadzer",32000}}};

    raspredeli(&kaf1,niza1,2);
    raspredeli(&kaf2,niza2,2);
    
    pechati((kafeterija[]){kaf1,kaf2},2,25000);

    return 0;
}